app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@sneakers.com'
 LIMIT 1
---
    public function login()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/')->with('error', 'Acceso no autorizado');
        }
        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();