app/Controllers/Orders.php

    public function show($orderId)
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión para ver tus compras');
        }

        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();
        $userModel = new \App\Models\UserModel();
        $db = \Config\Database::connect();

        $order = $db->table('orders')
            ->select('orders.*, users.name as user_name, users.email as user_email')
            ->join('users', 'users.id = orders.user_id')
            ->where('orders.id', $orderId)
            ->where('orders.user_id', $userId)
            ->get()
            ->getRowArray();

        if (!$order) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Compra no encontrada o no tienes permisos para verla');
        }

        $order['items'] = $db->table('order_items')
            ->select('order_items.*, products.name AS product_name, products.image_url, sizes.size_label')
            ->join('products', 'products.id = order_items.product_id')
            ->join('sizes', 'sizes.id = order_items.size_id')
            ->where('order_items.order_id', $orderId)
            ->get()
            ->getResultArray();
---
SELECT `orders`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`user_id`
WHERE `orders`.`id` = '12'
AND `orders`.`user_id` = '12'
SELECT `order_items`.*, `products`.`name` AS `product_name`, `products`.`image_url`, `sizes`.`size_label`
FROM `order_items`
JOIN `products` ON `products`.`id` = `order_items`.`product_id`
JOIN `sizes` ON `sizes`.`id` = `order_items`.`size_id`
WHERE `order_items`.`order_id` = '12'