app/Controllers/Products.php

SELECT *
FROM `brands`
SELECT *
FROM `categories`
SELECT *
FROM `sizes`
---
    public function create()
    {
        // Validar acceso solo a admin o vendedor
        if (!session()->get('logged_in') || !in_array(session()->get('user_role'), ['admin', 'vendedor'])) {
            return redirect()->to('/login')->with('error', 'Acceso no autorizado');
        }

        $brandModel = new BrandModel();
        $categoryModel = new CategoryModel();
        $sizeModel = new SizeModel();

        $data = [
            'brands'     => $brandModel->findAll(),
            'categories' => $categoryModel->findAll(),
            'sizes'      => $sizeModel->findAll(),
        ];

INSERT INTO `products` (`name`, `price`, `description`, `brand_id`, `category_id`, `image_url`) VALUES ('Nike Legend Essential 3 Next Nature Hombre', '119999', 'Zapatillas Entrenamiento Nike Legend Essential 3 Next Nature Hombre están diseñadas con una estructura ligera y duradera. Están fabricadas con materiales reciclados, lo que las convierte en una opción más sostenible sin comprometer el rendimiento. La suela ofrece una excelente tracción, mientras que la parte superior de malla proporciona ventilación para mantener los pies frescos durante los entrenamientos más exigentes.', '1', '4', '1750274816_f92f17dda1eebb40b78f.jpg')
---
        }

        // Insertar producto
        $productId = $productModel->insert([
            'name'        => $request['name'],
            'price'       => $request['price'],
            'description' => $request['description'],
            'brand_id'    => $request['brand_id'],
            'category_id' => $request['category_id'],
            'image_url'   => $imageName,
        ]);

INSERT INTO `product_sizes` (`product_id`, `size_id`, `stock`) VALUES (8, '1', '5')
---
                            'stock' => $existing->stock + $stock
                        ]);
                    } else {
                        $productSizeModel->insert([
                            'product_id' => $productId,
                            'size_id'    => $sizeId,
                            'stock'      => $stock,
                        ]);

SELECT `products`.*, `brands`.`name` AS `brand_name`, `categories`.`name` AS `category_name`
FROM `products`
LEFT JOIN `brands` ON `brands`.`id` = `products`.`brand_id`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
SELECT *
FROM `brands`
SELECT *
FROM `categories`
---
    public function index()
    {
        $productModel  = new \App\Models\ProductModel();
        $brandModel    = new \App\Models\BrandModel();
        $categoryModel = new \App\Models\CategoryModel();

        $search         = $this->request->getGet('search');
        $brandId        = $this->request->getGet('brand');
        $categoryId     = $this->request->getGet('category');

        $builder = $productModel
            ->select('products.*, brands.name AS brand_name, categories.name AS category_name')
            ->join('brands', 'brands.id = products.brand_id', 'left')
            ->join('categories', 'categories.id = products.category_id', 'left');

        if (!empty($search)) {
            $builder->like('products.name', $search);
        }

        if (!empty($brandId)) {
            $builder->where('products.brand_id', $brandId);
        }

        if (!empty($categoryId)) {
            $builder->where('products.category_id', $categoryId);
        }

        $products = $builder->get()->getResultArray();
        $brands     = $brandModel->findAll();
        $categories = $categoryModel->findAll();

SELECT `products`.*, `brands`.`name` as `brand_name`
FROM `products`
LEFT JOIN `brands` ON `brands`.`id` = `products`.`brand_id`
GROUP BY `products`.`id`
SELECT *
FROM `brands`
SELECT *
FROM `sizes`
SELECT `sizes`.`size_label`
FROM `product_sizes`
JOIN `sizes` ON `sizes`.`id` = `product_sizes`.`size_id`
WHERE `product_sizes`.`product_id` = '1'
---
    public function showProducts(){

        $productModel     = new \App\Models\ProductModel();
        $brandModel       = new \App\Models\BrandModel();
        $sizeModel        = new \App\Models\SizeModel();
        $productSizeModel = new \App\Models\ProductSizeModel();

        $brandId = $this->request->getGet('brand');
        $sizeId  = $this->request->getGet('size');

        $builder = $productModel
            ->select('products.*, brands.name as brand_name')
            ->join('brands', 'brands.id = products.brand_id', 'left');

        if (!empty($sizeId)) {
            $builder->join('product_sizes', 'product_sizes.product_id = products.id')
                    ->where('product_sizes.size_id', $sizeId);
        }

        if (!empty($brandId)) {
            $builder->where('products.brand_id', $brandId);
        }

        $productsRaw = $builder->groupBy('products.id')->get()->getResultArray();
        $brands = $brandModel->findAll();
        $sizes = $sizeModel->findAll();

        // Agregar talles disponibles por producto
        $products = [];
        foreach ($productsRaw as $product) {
            $productSizes = $productSizeModel
                ->select('sizes.size_label')
                ->join('sizes', 'sizes.id = product_sizes.size_id')
                ->where('product_sizes.product_id', $product['id'])
                ->findAll();

SELECT `products`.*, `brands`.`name` AS `brand_name`, `categories`.`name` AS `category_name`
FROM `products`
LEFT JOIN `brands` ON `brands`.`id` = `products`.`brand_id`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`id` = '1'
SELECT `sizes`.`id` as `size_id`, `sizes`.`size_label`, `product_sizes`.`stock`
FROM `product_sizes`
JOIN `sizes` ON `sizes`.`id` = `product_sizes`.`size_id`
WHERE `product_sizes`.`product_id` = '1'
---
public function show($id){
    $productModel     = new \App\Models\ProductModel();
    $brandModel       = new \App\Models\BrandModel();
    $sizeModel        = new \App\Models\SizeModel();
    $productSizeModel = new \App\Models\ProductSizeModel();

    $product = $productModel
        ->select('products.*, brands.name AS brand_name, categories.name AS category_name')
        ->join('brands', 'brands.id = products.brand_id', 'left')
        ->join('categories', 'categories.id = products.category_id', 'left')
        ->where('products.id', $id)
        ->get()
        ->getFirstRow('array');

    if (!$product) {
        throw new \CodeIgniter\Exceptions\PageNotFoundException('Producto no encontrado');
    }

    // Talles disponibles
    $sizes = $productSizeModel
        ->select('sizes.id as size_id, sizes.size_label, product_sizes.stock')
        ->join('sizes', 'sizes.id = product_sizes.size_id')
        ->where('product_sizes.product_id', $id)
        ->findAll();