app/Models/CartModel.php

    public function getUserCart($userId)
    {
        return $this->select('cart.*, products.name, products.price, products.image_url, sizes.size_label')
                    ->join('products', 'products.id = cart.product_id')
                    ->join('sizes', 'sizes.id = cart.size_id')
                    ->where('cart.user_id', $userId)
                    ->where('cart.active', 1)
                    ->findAll();
---
SELECT `cart`.*, `products`.`name` as `product_name`, `products`.`price`, `products`.`image_url`, `sizes`.`size_label`
FROM `cart`
JOIN `products` ON `products`.`id` = `cart`.`product_id`
JOIN `sizes` ON `sizes`.`id` = `cart`.`size_id`
WHERE `cart`.`user_id` = '5'
AND `cart`.`active` = 1